#include "Map.h"

static int stage1data[MAP_HEIGHT][MAP_WIDTH] = {
	{ 1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
	{ 1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{ 1,0,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,0,1,0,1,1,0,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,0,1},
	{ 1,0,1,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,1,0,0,1,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{ 1,0,1,0,1,1,0,1,0,1,1,1,1,0,1,4,1,0,1,0,1,1,1,1,0,1,0,1,0,1,1,1,0,1,1,1,1,0,1,1},
	{ 1,0,0,0,1,0,0,1,0,1,0,0,1,0,1,3,0,0,0,0,4,0,0,0,0,1,0,1,0,0,0,0,0,0,0,0,0,0,0,1},
	{ 1,0,1,1,1,0,1,1,0,1,0,1,1,0,1,3,1,1,1,0,1,1,1,1,0,1,0,1,1,1,0,1,1,1,1,0,1,0,1,1},
	{ 1,0,0,0,0,0,1,3,0,1,0,0,1,0,1,3,3,3,3,3,3,3,3,1,0,1,0,1,0,0,0,0,0,0,0,0,1,0,0,1},
	{ 1,0,1,1,1,1,1,3,1,1,0,1,1,0,0,3,1,1,0,1,1,1,3,1,0,1,0,1,0,1,1,1,1,0,1,1,1,0,1,1},
	{ 1,0,0,0,0,0,0,0,1,0,0,0,0,0,1,3,3,3,3,3,3,3,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
	{ 1<<16|10<<8|39,0,0,1,1,0,1,0,1,0,1,1,0,1,1,1,1,1,1,1,1,1,0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1<<16|10<<8|0},
	{ 1,0,1,0,0,0,1,0,0,0,1,0,0,0,1,0,1,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1},
	{ 1,0,1,0,1,1,1,1,1,0,1,1,0,1,1,0,1,0,1,0,1,1,0,1,0,0,0,0,0,0,0,1,0,1,0,1,1,0,1,1},
	{ 1,0,0,0,0,0,0,0,1,0,0,0,0,1,0,0,0,0,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,1,1},
	{ 1,0,1,1,1,1,1,0,1,1,0,1,0,1,0,1,1,1,1,0,1,0,1,1,1,1,1,1,1,1,1,1,0,1,0,1,1,0,1,1},
	{ 1,0,0,0,0,0,1,0,0,1,0,1,0,0,0,0,0,1,1,0,1,0,1,0,1,0,0,0,0,0,0,0,0,0,0,0,1,0,0,1},
	{ 1,0,1,1,1,0,1,1,0,1,0,1,0,1,1,1,0,1,0,1,1,0,0,0,0,0,1,0,1,0,1,0,1,0,1,1,1,1,0,1},
	{ 1,0,0,0,1,0,0,1,0,1,0,0,0,1,0,0,0,1,0,1,0,0,1,0,1,0,0,1,1,0,0,0,1,0,1,0,0,0,0,1},
	{ 1,0,1,0,1,1,0,1,0,1,0,1,1,1,0,1,0,1,0,1,0,1,1,0,1,1,0,0,0,0,1,0,1,0,1,0,1,0,1,1},
	{ 1,0,1,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,1,1,0,1,0,1,0,0,0,0,0,0,1},
	{ 1,0,1,1,1,1,0,1,1,1,0,1,1,1,1,1,0,1,0,1,1,1,1,1,0,0,0,0,0,0,1,0,1,0,1,1,1,0,1,1},
	{ 1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,1,0,1,1,1,0,0,0,0,0,0,0,0,1},
	{ 1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1},
};



Map::Map() : Base(eType_Field) {
	//画像複製
	m_img = COPY_RESOURCE("MapTip", CImage);
	item = 0;
	memcpy(stagedata, stage1data, sizeof(stage1data));
}

void Map::Draw() {
	item = 0;
	//マップチップによる表示の繰り返し
	for (int i = 0; i < MAP_HEIGHT; i++) {
		for (int j = 0; j < MAP_WIDTH; j++) {
			//表示しない制御
			if (stagedata[i][j] ==0 || stagedata[i][j]>4)continue;
			int t = stagedata[i][j];
			if (t == 3||t == 4) item++;
			//画像切り抜き
			m_img.SetRect(32 * t, 0, 32 * t + 32, 32);
			//表示サイズ設定
			m_img.SetSize(MAP_TIP_SIZE, MAP_TIP_SIZE);
			//表示位置設定
			m_img.SetPos(MAP_TIP_SIZE * j - m_scroll.x, MAP_TIP_SIZE * i - m_scroll.y);
			//描画
			m_img.Draw();
		}
	}
}
int Map::GetTip(const CVector2D& pos) {
	//列を計算
	int col = pos.x / MAP_TIP_SIZE;
	//列の制限(0～MAP_WIDTH-1)
	if (col < 0)col = 0;
	if (col > MAP_WIDTH - 1)col = MAP_WIDTH - 1;
	//行を計算
	int raw = pos.y / MAP_TIP_SIZE;
	//行の制限(0～MAP_HEIGHT-1)
	if (raw < 0) raw = 0;
	if (raw > MAP_HEIGHT - 1) raw = MAP_HEIGHT - 1;
	//チップデータを返却
	return GetTip(col, raw);
}
void Map::SetTip(const CVector2D& pos, int t)
{

	//列を計算
	int col = pos.x / MAP_TIP_SIZE;
	//列の制限(0～MAP_WIDTH-1)
	if (col < 0)col = 0;
	if (col > MAP_WIDTH - 1)col = MAP_WIDTH - 1;
	//行を計算
	int raw = pos.y / MAP_TIP_SIZE;
	//行の制限(0～MAP_HEIGHT-1)
	if (raw < 0) raw = 0;
	if (raw > MAP_HEIGHT - 1) raw = MAP_HEIGHT - 1;

	stagedata[raw][col] = t;
}
    int Map::GetTip(int col, int raw) {
	return stagedata[raw][col];
}

    int Map::CollisionMap(const CVector2D& pos) {
	//1点のみ検証
	int t = GetTip(pos);
	if (t == 1) return t;
	return 0;
}
	int Map::CollisionMap(const CVector2D& pos, const CRect& rect)
	{
		//左上
		int t = GetTip(CVector2D(pos.x + rect.m_left, pos.y + rect.m_top));
		if (t ==1) return t;
		//右上
		t = GetTip(CVector2D(pos.x + rect.m_right, pos.y + rect.m_top));
		if (t == 1) return t;
		//左下
		t = GetTip(CVector2D(pos.x + rect.m_left, pos.y + rect.m_bottom));
		if (t == 1) return t;
		//右下
		t = GetTip(CVector2D(pos.x + rect.m_right, pos.y + rect.m_bottom));
		if (t == 1) return t;
		return 0;
	}
